Also, when we rerun `terraform plan` (the actual resources have not been changed in between), we get:

```
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
Terraform will perform the following actions:
  # cloudcasa_kubebackup.daily_backup will be updated in-place
  ~ resource "cloudcasa_kubebackup" "daily_backup" {
      - copy_options                = jsonencode(
            {
              - azure_files_restore_options = {
                  - check_file_restore_status_interval_seconds = 5
                  - method                                     = "AUTO"
                  - pvc_restore_wait_seconds                   = 10
                }
            }
        ) -> null
      ~ copy_policy                 = "688b2e7863d24517d2911f86" -> (known after apply)
      ~ created                     = "Thu, 31 Jul 2025 16:33:09 GMT" -> (known after apply)
      ~ etag                        = "bfcaa1ad5e08782582baffef6084811d0383bd84" -> (known after apply)
        id                          = "688b9ac58d64dd9a1ff3e92b"
      ~ kubeoffload_id              = "688b9ac5ebe5db695068e387" -> (known after apply)
        name                        = "spaceware-prod-kube-backup"
      ~ offload_etag                = "6fcae386cd895ce297dcc230aa1d57dd96282749" -> (known after apply)
      ~ updated                     = "Thu, 31 Jul 2025 16:33:09 GMT" -> (known after apply)
        # (6 unchanged attributes hidden)
    }
  # cloudcasa_kubecluster.kubernetes_cluster will be updated in-place
  ~ resource "cloudcasa_kubecluster" "kubernetes_cluster" {
      ~ agent_url      = "https://api.cloudcasa.io/kubeclusteragents/ZpJsIjc3lqAREszdt-0i630GmpYzfhGgWW3hefJ3A3I.yaml" -> (known after apply)
      ~ created        = "Thu, 31 Jul 2025 16:28:09 GMT" -> (known after apply)
      ~ etag           = "0a1bd5b0aac08fd7747ca282b7fec0f8a91e7d6c" -> (known after apply)
        id             = "688b9999ceecab9665bc0d65"
      + links          = (known after apply)
        name           = "spaceware-prod-kube"
      ~ objectstore_id = "688b9999b8ef709485dd40ba" -> (known after apply)
      + status         = (known after apply)
      ~ updated        = "Thu, 31 Jul 2025 16:33:08 GMT" -> (known after apply)
        # (1 unchanged attribute hidden)
    }
  # cloudcasa_objectstore.s3_bucket must be replaced
-/+ resource "cloudcasa_objectstore" "s3_bucket" {
      ~ created       = "Thu, 31 Jul 2025 16:28:07 GMT" -> (known after apply)
      ~ etag          = "51e4afa46b9bb58e6e6de00d43b078d08c8621a6" -> (known after apply)
      ~ id            = "688b9999b8ef709485dd40ba" -> (known after apply)
        name          = "tooling-prod-s3-backup-spaceware-prod-kube"
      - private       = false -> null # forces replacement
      ~ updated       = "Thu, 31 Jul 2025 16:28:07 GMT" -> (known after apply)
        # (6 unchanged attributes hidden)
    }
Plan: 1 to add, 2 to change, 1 to destroy.
``` 

This should not happen: Terraform should tell that there is nothing to change following the IaC principles.
